/* ************************************************************************
 *       Filename:  06_星花的3层含义.c
 *    Description:  
 *        Version:  1.0
 *        Created:  2017年09月08日 11时35分17秒
 *       Revision:  none
 *       Compiler:  gcc
 *         Author:  YOUR NAME (), 
 *        Company:  
 * ************************************************************************/

#include <stdio.h>

int main()
{
	//1、*, 乘号
	int a = 10*2;

	//2、定义变量时， * 代表一种类型，和类型结合，不要和变量结合
	//定义一个变量p， 类型为int *, 这个变量p初始化为&a
	int *p = &a;
	/* 
	  //是这种方式
		int *p;
		p = &a;

		//不是这种情况
		int *p;
		*p = &a;
	*/

	//3、使用变量时，*作用，间接操作指针所执行的内存
	*p = 111; //等价于a = 111, *p就是a

	//4、对应一块内存(*p)，可以写，也可以读
	*p = 222; //写
	int b = *p;//读
	

	return 0;
}


