/* ************************************************************************
 *       Filename:  16_指针运算.c
 *    Description:  
 *        Version:  1.0
 *        Created:  2017年09月08日 16时00分20秒
 *       Revision:  none
 *       Compiler:  gcc
 *         Author:  YOUR NAME (), 
 *        Company:  
 * ************************************************************************/

#include <stdio.h>

int main()
{
	//指针只可以加法、减法，结合数组使用，才能体验价值
	int a[10];
	//首元素是什么类型 ===> int, 需要int *
	int * p1 = &a[0]; //数组名就是首元素地址，a 等价于&a[0]
	int * p2 = p1+1; //&a[1]
	int * p3 = p2+1; //&a[2]
	printf("p2 = %p, &a[1] = %p\n", p2, &a[1]);	
	printf("p3 = %p, &a[2] = %p\n", p3, &a[2]);	

	int *p = &a[0] + 1; // &a[1]  ===> &a[0] + 1 = &a[1]  ====> &a[1] - &a[0] = 1
	int n = &a[1] - &a[0]; //数组2个元素地址相减，达到的结果为元素相隔个数
	n = &a[9] - &a[0];
	n = (int)&a[1] - (int)&a[0]; //要想得到步长，要强制类型转换
	printf("n = %d\n", n);

	//int *p4 = &a[0] + &a[1];

	return 0;
}


